Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 148, 148, 8)       224       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 49, 49, 8)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 49, 49, 8)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 47, 47, 16)        1168      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 21, 21, 32)        4640      
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 10, 10, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 8, 8, 64)          18496     
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 2, 2, 128)         73856     
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 1, 1, 128)         0         
_________________________________________________________________
global_average_pooling2d_2 ( (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 129       
=================================================================
Total params: 98,513
Trainable params: 98,513
Non-trainable params: 0
_________________________________________________________________
